tutorials/RAS/2DScour/Allrun.pre
#!/bin/sh

# 1D case for initial condition

cd 1D

# create the mesh
blockMesh

# create the intial time folder
cp -r 0_org 0

# Run sedFoam
sedFoam_rbgh > log &

cd ..
