tutorials/RAS/2DScour/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
 (
	sedimentvelocity
	{
	field U.a; //field to initialise
	fields
	(
	z Ua
	);
	lookuptables (
	{
	name inletprofilesedvel;
	outOfBounds clamp;
	file "$FOAM_CASE/1d_profil/U.a0.xy";
	}
	{
	name inletprofilesedvelv;
	outOfBounds clamp;
	file "$FOAM_CASE/1d_profil/U.a1.xy";
	}
	{
	name inletprofilesedvelw;
	outOfBounds clamp;
	file "$FOAM_CASE/1d_profil/U.a2.xy";
	}
	);
        value uniform (1 0 0);
	expression "vector(inletprofilesedvel(pos().y),inletprofilesedvelv(pos().y),0)";
	keepPatches 1;
        }

	fluidvelocity
	{
	field U.b; //field to initialise
	fields
	(
	z Ub
	);
	lookuptables (
	{
	name inletprofilefvel;
	outOfBounds clamp;
	file "$FOAM_CASE/1d_profil/U.b0.xy";
	}
	{
	name inletprofilefvelv;
	outOfBounds clamp;
	file "$FOAM_CASE/1d_profil/U.b1.xy";
	}
	{
	name inletprofilefvelw;
	outOfBounds clamp;
	file "$FOAM_CASE/1d_profil/U.b2.xy";
	}
	);
        value uniform (1 0 0);
       	expression "vector(inletprofilefvel(pos().y), inletprofilefvelv(pos().y), 0)";
	keepPatches 1;
        }

       alpha.a
        {
        field alpha.a; //field to initialise
        fields
        (
        z alpha
        );
        lookuptables (
        {
        name inletprofilealpha;
        outOfBounds clamp;
        file "$FOAM_CASE/1d_profil/alpha.a.xy";
        }
        );
        expression "inletprofilealpha(pos().y)";
        keepPatches 1;
        }

       k.b
        {
        field k.b; //field to initialise
        fields
        (
        z k
        );
        lookuptables (
        {
        name inletprofilek;
        outOfBounds clamp;
        file "$FOAM_CASE/1d_profil/k.b.xy";
        }
        );
        expression "inletprofilek(pos().y)";
        keepPatches 1;
        }
/*
       epsilon.b
        {
        field epsilon.b; //field to initialise
        fields
        (
        z epsilon
        );
        lookuptables (
        {
        name inletprofilepsilon;
        outOfBounds clamp;
        file "$FOAM_CASE/1d_profil/epsilon.b.xy";
        }
        );
        expression "inletprofilepsilon(pos().y)";
        keepPatches 1;
        }
*/        
        omega.b
    	  {
            field omega.b;
            fields
            (
                z omega
            );
            lookuptables 
            (
                {
                    name inletprofilom;
                    outOfBounds clamp;
                    file "$FOAM_CASE/1d_profil/omega.b.xy";
                }
            );
            expression "inletprofilom(pos().y)";
            keepPatches 1;		
        }
 );

// ************************************************************************* //
